package root.utils;

import client.UserDataClient;
import org.springframework.web.client.RestTemplate;
import org.telegram.telegrambots.bots.TelegramLongPollingBot;
import org.telegram.telegrambots.meta.api.objects.Update;

import java.util.HashMap;
import java.util.Map;

import org.telegram.telegrambots.meta.exceptions.TelegramApiException;
import root.config.BotConfig;
import root.handler.Handler;
import root.ui.UIRenderer;

public class LoadForecastTelegramBot extends TelegramLongPollingBot {

    private final RestTemplate restTemplate = new RestTemplate(); // Create a RestTemplate instance
    private final UserDataClient userDataClient = new UserDataClient(restTemplate); // Pass the RestTemplate to UserDataClient
    private final Handler handler = new Handler(userDataClient);  // Pass UserDataClient to Handler
    private final UIRenderer uiRenderer = new UIRenderer(userDataClient); // Pass the UserDataClient to UIRenderer
    private final Map<Long, String> userStates = new HashMap<>();  // Для отслеживания состояния пользователя
    public static Map<Long, UserData> userData = new HashMap<>();  // Хранение данных пользователя

    @Override
    public String getBotUsername() {
        return BotConfig.BOT_USERNAME;
    }

    @Override
    public String getBotToken() {
        return BotConfig.BOT_TOKEN;
    }

    @Override
    public void onUpdateReceived(Update update) {
        // Проверка, есть ли сообщение и содержит ли оно текст
        if (update.hasMessage() && update.getMessage().hasText()) {
            String messageText = update.getMessage().getText(); // Текст сообщения
            long chatId = update.getMessage().getChatId(); // ID чата

            if (userStates.containsKey(chatId)) {
                // Если пользователь уже находится в процессе ввода данных, обрабатываем его состояние
                try {
                    handler.handleState(chatId, messageText, this, userStates, userData);
                } catch (TelegramApiException e) {
                    throw new RuntimeException(e);
                }
            } else {
                // Если это новое сообщение от пользователя, начинаем процесс с основного меню
                handler.handleInitialMessage(chatId, messageText, this, userStates, userData);
            }
        }
    }

    // Получаем список станций для каждой линии метро
    public Map<String, String[]> getMetroLines() {
        Map<String, String[]> metroLines = new HashMap<>();

        metroLines.put("Сокольническая линия (красная)", new String[]{
                "Бульвар Рокоссовского",
                "Черкизовская",
                "Преображенская площадь",
                "Сокольники",
                "Красносельская",
                "Комсомольская",
                "Красные ворота",
                "Чистые пруды",
                "Лубянка",
                "Охотный ряд",
                "Библиотека им. Ленина",
                "Кропоткинская",
                "Парк Культуры",
                "Фрунзенская",
                "Спортивная",
                "Воробьёвы горы",
                "Университет",
                "Пр-т Вернадского",
                "Юго-Западная",
                "Тропарёво",
                "Румянцево",
                "Саларьево",
                "Филатов Луг",
                "Прокшино",
                "Ольховая",
                "Коммунарка",
                "Потапово"
        });

        metroLines.put("Замоскворецкая линия (зелёная)", new String[]{
                "Ховрино",
                "Беломорская",
                "Речной вокзал",
                "Водный стадион",
                "Войковская",
                "Сокол",
                "Аэропорт",
                "Динамо",
                "Белорусская",
                "Маяковская",
                "Тверская",
                "Театральная",
                "Новокузнецкая",
                "Павелецкая",
                "Автозаводская",
                "Технопарк",
                "Коломенская",
                "Кантемировская",
                "Царицыно",
                "Каширская",
                "Орехово",
                "Домодедовская",
                "Красногвардейская",
                "Алма-Атинская"
        });


        metroLines.put("Арбатско-Покровская линия (синяя)", new String[]{
                "Пятницкое шоссе",
                "Митино",
                "Волоколамская",
                "Мякинино",
                "Строгино",
                "Крылатское",
                "Молодёжная",
                "Кунцевская",
                "Славянский бульвар",
                "Парк Победы",
                "Киевская",
                "Смоленская",
                "Арбатская",
                "Площадь Революции",
                "Курская",
                "Бауманская",
                "Электрозаводская",
                "Семёновская",
                "Партизанская",
                "Измайловская",
                "Первомайская",
                "Щёлковская",
                "Гольяново"
        });


        metroLines.put("Филёвская линия (голубая)", new String[]{
                "Международная",
                "Выставочная",
                "Киевская",
                "Студенческая",
                "Кутузовская",
                "Фили",
                "Багратионовская",
                "Филёвский парк",
                "Пионерская",
                "Кунцевская"
        });


        metroLines.put("Кольцевая линия (коричневая)", new String[]{
                "Комсомольская",
                "Курская",
                "Таганская",
                "Павелецкая",
                "Добрынинская",
                "Октябрьская",
                "Парк Культуры",
                "Киевская",
                "Краснопресненская",
                "Белорусская",
                "Новослободская",
                "Проспект Мира"
        });


        metroLines.put("Калужско-Рижская линия (оранжевая)", new String[]{
                "Мытищи",
                "Челобитьево",
                "Медведково",
                "Бабушкинская",
                "Свиблово",
                "Ботанический сад",
                "ВДНХ",
                "Алексеевская",
                "Рижская",
                "Проспект Мира",
                "Сухаревская",
                "Тургеневская",
                "Китай-город",
                "Третьяковская",
                "Октябрьская",
                "Шаболовская",
                "Ленинский проспект",
                "Академическая",
                "Профсоюзная",
                "Новые Черёмушки",
                "Калужская",
                "Беляево",
                "Коньково",
                "Тёплый Стан",
                "Ясенево",
                "Новоясеневская"
        });


        metroLines.put("Таганско-Краснопресненская линия (фиолетовая)", new String[]{
                "Планерная",
                "Сходненская",
                "Тушинская",
                "Спартак",
                "Щукинская",
                "Октябрьское поле",
                "Полежаевская",
                "Беговая",
                "Улица 1905 года",
                "Баррикадная",
                "Пушкинская",
                "Кузнецкий мост",
                "Китай-город",
                "Таганская",
                "Пролетарская",
                "Волгоградский проспект",
                "Текстильщики",
                "Кузьминки",
                "Рязанский проспект",
                "Выхино",
                "Лермонтовский проспект",
                "Жулебино",
                "Котельники"
        });


        metroLines.put("Калининская линия (жёлтая)", new String[]{
                "Внуково",
                "Пыхтино",
                "Рассказовка",
                "Новопеределкино",
                "Боровское шоссе",
                "Солнцево",
                "Говорово",
                "Озёрная",
                "Мичуринский проспект",
                "Раменки",
                "Ломоносовский проспект",
                "Минская",
                "Парк Победы"
        });


        metroLines.put("Серпуховско-Тимирязевская линия (серая)", new String[]{
                "Алтуфьево", "Аннино", "Бибирево", "Боровицкая", "Бульвар Дмитрия Донского", "Владыкино",
                "Дмитровская", "Менделеевская", "Нагатинская", "Нагорная", "Нахимовский Проспект",
                "Отрадное", "Петровско-Разумовская", "Полянка", "Пражская", "Савеловская", "Севастопольская",
                "Серпуховская", "Тимирязевская", "Тульская", "Улица академика Янгеля", "Цветной бульвар",
                "Чертановская", "Чеховская", "Южная"
        });

        metroLines.put("Люблинско-Дмитровская линия (салатовая)", new String[]{
                "Физтех",
                "Лианозово",
                "Яхромская",
                "Селигерская",
                "Верхние Лихоборы",
                "Окружная",
                "Фонвизинская",
                "Бутырская",
                "Марьина роща",
                "Достоевская",
                "Трубная",
                "Сретенский бульвар",
                "Чкаловская",
                "Римская",
                "Крестьянская застава",
                "Дубровка",
                "Кожуховская",
                "Печатники",
                "Волжская",
                "Люблино",
                "Братиславская",
                "Марьино",
                "Борисово",
                "Шипиловская",
                "Зябликово"
        });


        metroLines.put("Большая кольцевая линия (бирюзовая)", new String[]{
                "Кунцевская",
                "Терехово",
                "Мнёвники",
                "Народное Ополчение",
                "Хорошёвская",
                "ЦСКА",
                "Петровский парк",
                "Савёловская",
                "Рижская",
                "Сокольники",
                "Электрозаводская",
                "Лефортово",
                "Авиамоторная",
                "Нижегородская",
                "Текстильщики",
                "Печатники",
                "Нагатинский затон",
                "Кленовый бульвар",
                "Каширская",
                "Варшавская",
                "Каховская",
                "Зюзино",
                "Воронцовская",
                "Новаторская",
                "Проспект Вернадского",
                "Мичуринский проспект",
                "Аминьевская",
                "Давыдково",
                "Кунцевская"
        });


        return metroLines;
    }


    // Получаем список станций для каждой линии МЦД
    public Map<String, String[]> getMCDLines() {
        Map<String, String[]> mcdLines = new HashMap<>();

        mcdLines.put("МЦД-1 «Белорусско-Савеловский диаметр»", new String[]{
                "Баковка", "Беговая", "Белорусская", "Бескудниково", "Водники", "Дегунино",
                "Долгопрудная", "Кунцевская", "Лианозово", "Лобня", "Марк", "Немчиновка",
                "Новодачная", "Одинцово", "Окружная", "Рабочий Посёлок", "Савеловская",
                "Сетунь", "Сколково", "Славянский бульвар", "Тестовская", "Тимирязевская",
                "Фили", "Хлебниково", "Шереметьевская"
        });

        mcdLines.put("МЦД-2 «Курско-Рижский диаметр»", new String[]{
                "Аникеевка", "Битца", "Бутово", "Волоколамская", "Гражданская", "Депо",
                "Дмитровская", "Калитники", "Красногорская", "Красный Балтиец", "Красный Строитель",
                "Курская", "Курьяново", "Люблино", "Марьина Роща", "Москва-Товарная",
                "Москворечье", "Нахабино", "Новохохловская", "Опалиха", "Остафьево",
                "Павшино", "Пенягино", "Перерва", "Печатники", "Площадь трёх вокзалов",
                "Подольск", "Покровское", "Рижская", "Силикатная", "Стрешнево", "Текстильщики",
                "Трикотажная", "Тушинская", "Царицыно", "Щербинка", "Щукинская"
        });

        mcdLines.put("МЦД-3 «Ленинградско-Казанский диаметр»", new String[]{
                "Авиамоторная", "Андроновка", "Быково", "Вешняки", "Выхино", "Грачёвская",
                "Есенинская", "Зеленоград-Крюково", "Ильинская", "Ипподром", "Косино",
                "Красково", "Кратово", "Левобережная", "Лихоборы", "Люберцы", "Малаховка",
                "Митьково", "Молжаниново", "Моссельмаш", "Новоподрезково", "Останкино",
                "Отдых", "Панки", "Перово", "Петровско-Разумовская", "Плющево", "Подрезково",
                "Раменское", "Сортировочная", "Сходня", "Томилино", "Удельная", "Ухтомская",
                "Фабричная", "Фирсановская", "Химки", "Ховрино", "Электрозаводская"
        });

        mcdLines.put("МЦД-4 «Калужско-Нижегородский диаметр»", new String[]{
                "Аминьевская", "Апрелевка", "Белорусская", "Внуково", "Железнодорожная",
                "Кокошкино", "Крёкшино", "Курская", "Кусково", "Кутузовская", "Кучино",
                "Лесной Городок", "Марьина Роща", "Матвеевская", "Мещерская", "Минская",
                "Мичуринец", "Москва-Сити", "Нижегородская", "Никольское", "Новогиреево",
                "Новопеределкино", "Ольгино", "Очаково", "Переделкино", "Площадь трёх вокзалов",
                "Победа", "Поклонная", "Реутов", "Савеловская", "Салтыковская", "Санино",
                "Серп и Молот", "Солнечная", "Толстопальцево", "Чухлинка"
        });

        return mcdLines;
    }
}
